## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                       |
|----------|--------------------------------------------------|
| update   | `aws_lb.ai_answers`                              |
| recreate | `aws_security_group.ai_answers_load_balancer_sg` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb.ai_answers will be updated in-place
  ~ resource "aws_lb" "ai_answers" {
        id                                                           = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:loadbalancer/app/ai-answers-lb/054264388446064f"
        name                                                         = "ai-answers-lb"
      ~ security_groups                                              = [
          - "sg-08e35f1019824d56a",
        ] -> (known after apply)
        tags                                                         = {
            "CostCentre" = "ai-answers-staging"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.ai_answers_load_balancer_sg must be replaced
-/+ resource "aws_security_group" "ai_answers_load_balancer_sg" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:992382783569:security-group/sg-08e35f1019824d56a" -> (known after apply)
      ~ description            = "Security group for load balancer" -> "Security group for ai-answers staging load balancer" # forces replacement
      ~ id                     = "sg-08e35f1019824d56a" -> (known after apply)
      ~ name                   = "ai_answers_load_balancer_sg" -> "ai-answers_load_balancer_sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "992382783569" -> (known after apply)
        tags                   = {
            "CostCentre" = "ai-answers-staging"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ ai_answers_load_balancer_sg = "sg-08e35f1019824d56a" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.ai_answers_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ai_answers_load_balancer_sg"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
